/* -------------------------------------------------------- *
  *   MobileDevice.h - Interface to MobileDevice.framework   *
  *                  - Licensed under GNU Lesser GPL         *
  * -------------------------------------------------------- */
 
 #if !defined(MOBILEDEVICE_H)
 #define MOBILEDEVICE_H 1
     
 #if defined(_MSC_VER)
 #  pragma pack(push, 1)
 #  define __PACK
 #else
 #  define __PACK __attribute__((__packed__))
 #endif
 
 #if defined(WIN32)
 #  define __DLLIMPORT [DllImport("iTunesMobileDevice.dll")]
     using namespace System::Runtime::InteropServices;
 #  include <CoreFoundation.h>
     typedef unsigned int mach_error_t;
 #elif defined(__APPLE__)
 #  define __DLLIMPORT
 #  include <CoreFoundation/CoreFoundation.h>
 #  include <mach/error.h>
 #endif    
     
     /* Error codes */
 #define MDERR_APPLE_MOBILE  (err_system(0x3a))
 #define MDERR_IPHONE        (err_sub(0))
     
     /* Apple Mobile (AM*) errors */
 #define MDERR_OK                ERR_SUCCESS
 #define MDERR_SYSCALL           (ERR_MOBILE_DEVICE | 0x01)
 #define MDERR_OUT_OF_MEMORY     (ERR_MOBILE_DEVICE | 0x03)
 #define MDERR_QUERY_FAILED      (ERR_MOBILE_DEVICE | 0x04) 
 #define MDERR_INVALID_ARGUMENT  (ERR_MOBILE_DEVICE | 0x0b)
 #define MDERR_DICT_NOT_LOADED   (ERR_MOBILE_DEVICE | 0x25)
     
     /* Apple File Connection (AFC*) errors */
 #define MDERR_AFC_OUT_OF_MEMORY 0x03
     
     /* USBMux errors */
 #define MDERR_USBMUX_ARG_NULL   0x16
 #define MDERR_USBMUX_FAILED     0xffffffff
     
     /* Messages passed to device notification callbacks: passed as part of
      * AMDeviceNotificationCallbackInfo. */
 #define ADNCI_MSG_CONNECTED     1
 #define ADNCI_MSG_DISCONNECTED  2
 #define ADNCI_MSG_UNSUBSCRIBED  3
     
 #define AMD_IPHONE_PRODUCT_ID   0x1290
     //#define AMD_IPHONE_SERIAL       ""
     
     /* Services, found in /System/Library/Lockdown/Services.plist */
 #define AMSVC_AFC                   CFSTR("com.apple.afc")
 #define AMSVC_BACKUP                CFSTR("com.apple.mobilebackup")
 #define AMSVC_CRASH_REPORT_COPY     CFSTR("com.apple.crashreportcopy")
 #define AMSVC_DEBUG_IMAGE_MOUNT     CFSTR("com.apple.mobile.debug_image_mount")
 #define AMSVC_NOTIFICATION_PROXY    CFSTR("com.apple.mobile.notification_proxy")
 #define AMSVC_PURPLE_TEST           CFSTR("com.apple.purpletestr")
 #define AMSVC_SOFTWARE_UPDATE       CFSTR("com.apple.mobile.software_update")
 #define AMSVC_SYNC                  CFSTR("com.apple.mobilesync")
 #define AMSVC_SCREENSHOT            CFSTR("com.apple.screenshotr")
 #define AMSVC_SYSLOG_RELAY          CFSTR("com.apple.syslog_relay")
 #define AMSVC_SYSTEM_PROFILER       CFSTR("com.apple.mobile.system_profiler")
     
 CF_EXTERN_C_BEGIN
     
     typedef UInt32 AFCError;
     typedef UInt32 USBMuxError;
 
     /* Structure that contains internal data used by AMDevice... functions. Never try 
      * to access its members directly! Use AMDeviceCopyDeviceIdentifier, 
      * AMDeviceGetConnectionID, AMDeviceRetain, AMDeviceRelease instead. */
     struct AMDevice {
         CFRuntimeBase _uuid;          /* 0  */
         UInt32 _deviceID;           /* 16 */
         UInt32 _productID;          /* 20 - set to AMD_IPHONE_PRODUCT_ID */
         CFStringRef _serial;        /* 24 - serial string of device */
         UInt32 _unknown0;           /* 28 */
         UInt32 _unknown1;           /* 32 - reference counter, increased by AMDeviceRetain, decreased by AMDeviceRelease */
         UInt32 _lockdownConnection; /* 36 */
         UInt8 _unknown2[8];         /* 40 */
 #if (__ITUNES_VER > 740)
         UInt32 _unknown3;           /* 48 - used to store CriticalSection Handle*/
 #if (__ITUNES_VER >= 800)
         UInt8 _unknown4[24];        /* 52 */
 #endif
 #endif
     } __PACK;
     typedef struct __AMDevice AMDevice;
     typedef const AMDevice *AMDeviceRef;
     
     typedef void (*AMDeviceNotificationCallback)(AMDeviceCallbackInfoRef);
     
     struct __AMDeviceNotification {
         UInt32 _unknown0;                       /* 0  */
         UInt32 _unknown1;                       /* 4  */
         UInt32 _unknown2;                       /* 8  */
         AMDeviceNotificationCallback _callback; /* 12 */ 
         UInt32 _cookie;                         /* 16 */
     } __PACK;
     typedef struct __AMDeviceNotification AMDeviceNotification;
     typedef const AMDeviceNotification *AMDeviceNotificationRef;
     
     struct __AMDeviceCallbackInfo {
         AMDeviceRef _device; /* 0  */
         UInt32 _type;        /* 52 */
     } __PACK;
     typedef struct __AMDeviceCallbackInfo AMDeviceCallbackInfo;
     typedef AMDeviceCallbackInfo *AMDeviceCallbackInfoRef;
     
     struct __AMDeviceNotification {
         UInt32 _unknown0; /* 0  */
         UInt32 _unknown1; /* 4  */
         UInt32 _unknown2; /* 8  */
         void *callback;   /* 12 - TODO: fix type */
         UInt32 _unknown3; /* 16 */
     } __PACK;
     typedef struct __AMDeviceNotification AMDeviceNotification;
     typedef AMDeviceNotification *AMDeviceNotificationRef;
     
     struct __AMDeviceConnection {
         UInt8 _unknown[44]; /* 0 */
     } __PACK;
     typedef struct __AMDeviceConnection AMDeviceConnection;
     typedef AMDeviceConnection *AMDeviceConnectionRef;
     
     struct __AMDeviceNotificationCallbackInfo {
         AMDeviceRef _device;                   /* 0 - device */ 
         UInt32 _message;                       /* 4 - one of ADNCI_MSG_* */
         AMDeviceNotificationRef _subscription; /* 8 */
     } __PACK;
     typedef struct __AMDeviceNotificationCallbackInfo AMDeviceNotificationCallbackInfo;
     typedef AMDeviceNotificationCallbackInfo *AMDeviceNotificationCallbackInfoRef;
     
     /* The type of the device notification callback function. */
     typedef void (*AMDeviceNotificationCallback)(AMDeviceNotificationCallbackInfoRef, int _cookie);
     
     /* The type of the _AMDDeviceAttached function.
      * TODO: change to correct type. */
     typedef void *AMDDeviceAttatchedCallback;
     
     /* The type of the device restore notification callback functions.
      * TODO: change to correct type. */
     typedef void (*AMRestoreDeviceNotificationCallback)(AMRecoveryDeviceRef);
     
     /* This is a CoreFoundation object of class AMRecoveryModeDevice. */
     struct __AMRecoveryDevice {
         UInt8 _unknown0;                               /* 0  - sizeof(CFRuntimeBase) == 16 */
         AMRestoreDeviceNotificationCallback _callback; /* 8  */
         void *_userInfo;                               /* 12 */
         UInt8 unknown1[12];                            /* 16 */
         UInt32 _readWritePipe;                         /* 28 */
         UInt8 _readPipe;                               /* 32 */
         UInt8 _writeControlPipe;                       /* 33 */
         UInt8 _readUnknownPipe;                        /* 34 */
         UInt8 _writeFilePipe;                          /* 35 */
         UInt8 _writeInputPipe;                         /* 36 */
     } __PACK;
     typedef struct __AMRecoveryDevice AMRecoveryDevice;
     typedef const AMRecoveryDevice *AMRecoveryDeviceRef;
     
     /* A CoreFoundation object of class AMRestoreModeDevice. */
     struct __AMRestoreDevice {
         UInt8 _unknown0[8];  /* 0  - sizeof(CFRuntimeBase) == 16 */
         UInt8 _unknown1[24]; /* 8  */
         SInt32 _port;        /* 32 */
     } __PACK;
     typedef struct __AMRestoreDevice AMRestoreDevice;
     typedef const AMRestoreDevice *AMRestoreDeviceRef;
     
     /* The type of the device restore notification callback functions.
      * TODO: change to correct type. */
     typedef void (*AMRestoreDeviceNotificationCallback)(AMRecoveryDeviceRef);
     
     struct __AFCConnection {
         UInt32 _handle;          /* 0  */
         UInt32 _unknown0;        /* 4  */
         UInt8 _unknown1;         /* 8  */
         UInt8 _padding[3];       /* 9  */
         UInt32 _unknown2;        /* 12 */
         UInt32 _unknown3;        /* 16 */
         UInt32 _unknown4;        /* 20 */
         UInt32 _fsBlockSize;     /* 24 */
         UInt32 _socketBlockSize; /* 28 - always 0x3c */
         UInt32 _ioTimeout;       /* 32 - from AFCConnectionOpen, usu. 0 */
         void *_afcLock;          /* 36 */
         UInt32 _context;         /* 40 */
     } __PACK;
     typedef struct __AFCConnection AFCConnection;
     typedef const AFCConnection *AFCConnectionRef;
     
     struct __AFCDeviceInfo {
         UInt8 _unknown[12]; /* 0 */
     } __PACK;
     typedef struct __AFCDeviceInfo AFCDeviceInfo;
     typedef const AFCDeviceInfo *AFCDeviceInfoRef;
 
     struct __AFCDirectory {
         UInt8 _unknown[0]; /* 0 - size unknown */
     } __PACK;
     typedef struct __AFCDirectory AFCDirectory;
     typedef const AFCDirectory *AFCDirectoryRef;
 
     struct __AFCDictionary {
         UInt8 _unknown[0]; /* 0 - size unknown */
     } __PACK;
     typedef struct __AFCDictionary AFCDictionary;
     typedef const AFCDictionary *AFCDictionaryRef;
     
     typedef UInt64 AFCFileRef;
     
     struct __USBMuxListener1 { 
         UInt32 _unknown0;                     /* 0  - set to 1 */
         void *_unknown1;                      /* 4  */
         AMDDeviceAttatchedCallback _callback; /* 8  - set to _AMDDeviceAttached */
         UInt32 _unknown3;                     /* 12 */
         UInt32 _unknown4;                     /* 16 */
         UInt32 _unknown5;                     /* 20 */
     } __PACK;
     typedef struct __USBMuxListener1 USBMuxListener1;
     typedef const USBMuxListener1 *USBMuxListener1Ref;
     
     struct __USBMuxListener2 {
         UInt8 _unknown[48];  /* 0  */
         UInt8 _buffer[4096]; /* 48 */
     } __PACK;
     typedef struct __USBMuxListener2 USBMuxListener2;
     typedef const USBMuxListener2 *USBMuxListener2Ref;
     
     struct __AMBootloaderControlPacket {
         UInt8 _opcode;     /* 0 */
         UInt8 _length;     /* 1 */
         UInt8 _magic[2];   /* 2 - set to 0x34, 0x12 */
         UInt8 _payload[0]; /* 4 - size unknown */
     } __PACK;
     typedef struct __AMBootloaderControlPacket AMBootloaderControlPacket;
     typedef const AMBootloaderControlPacket *AMBootloaderControlPacketRef;
     
     /* ----------------------------------------------------------------------------
      *   Public routines
      * ------------------------------------------------------------------------- */
     
     /*  Registers a notification with the current run loop. The callback gets
      *  copied into the notification struct, as well as being registered with the
      *  current run loop. Cookie gets copied into cookie in the same.
